; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v7 ?v6)
             (pred_6 ?v4 ?v12)
             (pred_5 ?v7 ?v12)
             (pred_4 ?v2 ?v7 )
	     (pred_12 ?v7)
             (pred_9 ?v10)
             (pred_2 ?v4)
             (pred_7 ?v12)
             (pred_3 ?v7)
             (pred_10 ?v4)
             (pred_8 ?v7)
             (pred_1 ))



(:action op_1
:parameters (?v13 ?v5 ?v8 ?v9)
:precondition (and (pred_9 ?v13) (pred_9 ?v5) (pred_2 ?v8) (pred_7 ?v9)
          (pred_11 ?v13 ?v5) (pred_6 ?v8 ?v9)
                   (pred_5 ?v5 ?v9) (pred_12 ?v13) 
                   (pred_3 ?v5) (pred_10 ?v8))
:effect (and  (pred_8 ?v5) (not (pred_3 ?v5))))


(:action op_4
:parameters (?v13 ?v1)
:precondition (and (pred_9 ?v13) (pred_9 ?v1)
               (pred_12 ?v13) (pred_11 ?v13 ?v1) (pred_8 ?v1))
:effect (and (pred_12 ?v1) (not (pred_12 ?v13))))

(:action op_5
:parameters (?v13 ?v8)
:precondition (and (pred_9 ?v13) (pred_2 ?v8) 
                  (pred_12 ?v13) (pred_4 ?v8 ?v13) (pred_1 ))
:effect (and (pred_10 ?v8)
   (not (pred_4 ?v8 ?v13)) (not (pred_1 ))))


(:action op_3
:parameters (?v13 ?v3 ?v11)
:precondition (and (pred_9 ?v13) (pred_2 ?v3) (pred_2 ?v11)
                  (pred_12 ?v13) (pred_10 ?v11) (pred_4 ?v3 ?v13))
:effect (and (pred_10 ?v3) (pred_4 ?v11 ?v13)
        (not (pred_10 ?v11)) (not (pred_4 ?v3 ?v13))))

(:action op_2
:parameters (?v13 ?v8)
:precondition (and (pred_9 ?v13) (pred_2 ?v8) 
                  (pred_12 ?v13) (pred_10 ?v8))
:effect (and (pred_1 ) (pred_4 ?v8 ?v13) (not (pred_10 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_15 obj_27 obj_05 obj_13 obj_23 obj_26 obj_02 obj_04 obj_06 obj_03 obj_20 obj_19 obj_17 obj_18 obj_09 obj_07 obj_01 obj_08 obj_30 obj_21 obj_10 obj_31 obj_22 obj_25 obj_16
    obj_24 obj_28 obj_12
    obj_32 obj_29 obj_14 obj_11
    )

    (:init
       (pred_1)

       (pred_9 obj_15)
       (pred_9 obj_27)
       (pred_9 obj_05)
       (pred_9 obj_13)
       (pred_9 obj_23)
       (pred_9 obj_26)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_9 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_18)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_01)
       (pred_9 obj_08)
       (pred_9 obj_30)
       (pred_9 obj_21)
       (pred_9 obj_10)
       (pred_9 obj_31)
       (pred_9 obj_22)
       (pred_9 obj_25)
       (pred_9 obj_16)
       (pred_7 obj_24)
       (pred_7 obj_28)
       (pred_7 obj_12)
       (pred_2 obj_32)
       (pred_2 obj_29)
       (pred_2 obj_14)
       (pred_2 obj_11)

       (pred_11 obj_15 obj_26)
       (pred_11 obj_15 obj_27)
       (pred_11 obj_27 obj_02)
       (pred_11 obj_27 obj_05)
       (pred_11 obj_27 obj_15)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_05 obj_27)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_13 obj_23)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_23 obj_03)
       (pred_11 obj_23 obj_13)
       (pred_11 obj_26 obj_20)
       (pred_11 obj_26 obj_02)
       (pred_11 obj_26 obj_15)
       (pred_11 obj_02 obj_19)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_02 obj_27)
       (pred_11 obj_02 obj_26)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_04 obj_06)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_06 obj_13)
       (pred_11 obj_06 obj_04)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_03 obj_23)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_20 obj_07)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_26)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_02)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_17 obj_18)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_18 obj_30)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_18 obj_17)
       (pred_11 obj_09 obj_21)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_07 obj_20)
       (pred_11 obj_01 obj_31)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_08 obj_22)
       (pred_11 obj_08 obj_30)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_30 obj_25)
       (pred_11 obj_30 obj_21)
       (pred_11 obj_30 obj_18)
       (pred_11 obj_30 obj_08)
       (pred_11 obj_21 obj_16)
       (pred_11 obj_21 obj_09)
       (pred_11 obj_21 obj_30)
       (pred_11 obj_10 obj_31)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_31 obj_22)
       (pred_11 obj_31 obj_01)
       (pred_11 obj_31 obj_10)
       (pred_11 obj_22 obj_25)
       (pred_11 obj_22 obj_08)
       (pred_11 obj_22 obj_31)
       (pred_11 obj_25 obj_16)
       (pred_11 obj_25 obj_30)
       (pred_11 obj_25 obj_22)
       (pred_11 obj_16 obj_21)
       (pred_11 obj_16 obj_25)
       (pred_3 obj_27)
       (pred_3 obj_04)
       (pred_3 obj_26)
       (pred_3 obj_25)
       (pred_5  obj_27 obj_24)
       (pred_5  obj_04 obj_28)
       (pred_5  obj_26 obj_12)
       (pred_5  obj_25 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_13)
       (pred_8 obj_23)
       (pred_8 obj_02)
       (pred_8 obj_06)
       (pred_8 obj_03)
       (pred_8 obj_20)
       (pred_8 obj_19)
       (pred_8 obj_17)
       (pred_8 obj_18)
       (pred_8 obj_09)
       (pred_8 obj_07)
       (pred_8 obj_01)
       (pred_8 obj_08)
       (pred_8 obj_30)
       (pred_8 obj_21)
       (pred_8 obj_10)
       (pred_8 obj_31)
       (pred_8 obj_22)
       (pred_8 obj_16)

       (pred_6  obj_32 obj_24)
       (pred_6  obj_29 obj_28)
       (pred_6  obj_14 obj_12)
       (pred_6  obj_11 obj_12)
       (pred_4 obj_32 obj_05)
       (pred_4 obj_29 obj_13)
       (pred_4 obj_14 obj_08)
       (pred_4 obj_11 obj_22)
       (pred_12 obj_19)
    )

    (:goal (and
       (pred_4 obj_32 obj_20)
       (pred_4 obj_29 obj_31)
       (pred_4 obj_14 obj_03)
    ))
(:constraints
  (always (not (pred_12 obj_06)))
)
)

; plan
1. (op_4 obj_19 obj_17)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_17)
   goals met: 0 of 3
2. (op_4 obj_17 obj_08)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_08)
   goals met: 0 of 3
3. (op_5 obj_08 obj_14)
   deleted: (pred_4 obj_14 obj_08) (pred_1)
   added: (pred_10 obj_14)
   goals met: 0 of 3
4. (op_4 obj_08 obj_17)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_17)
   goals met: 0 of 3
5. (op_4 obj_17 obj_18)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_18)
   goals met: 0 of 3
6. (op_4 obj_18 obj_09)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_09)
   goals met: 0 of 3
7. (op_4 obj_09 obj_03)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_03)
   goals met: 0 of 3
8. (op_2 obj_03 obj_14)
   deleted: (pred_10 obj_14)
   added: (pred_1) (pred_4 obj_14 obj_03)
   goals met: 1 of 3
9. (op_4 obj_03 obj_23)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_23)
   goals met: 1 of 3
10. (op_4 obj_23 obj_13)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_13)
   goals met: 1 of 3
11. (op_5 obj_13 obj_29)
   deleted: (pred_4 obj_29 obj_13) (pred_1)
   added: (pred_10 obj_29)
   goals met: 1 of 3
12. (op_4 obj_13 obj_05)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_05)
   goals met: 1 of 3
13. (op_1 obj_05 obj_04 obj_29 obj_28)
   deleted: (pred_3 obj_04)
   added: (pred_8 obj_04)
   goals met: 1 of 3
14. (op_4 obj_05 obj_04)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_04)
   goals met: 1 of 3
15. (op_2 obj_04 obj_29)
   deleted: (pred_10 obj_29)
   added: (pred_1) (pred_4 obj_29 obj_04)
   goals met: 1 of 3
16. (op_4 obj_04 obj_05)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_05)
   goals met: 1 of 3
17. (op_5 obj_05 obj_32)
   deleted: (pred_4 obj_32 obj_05) (pred_1)
   added: (pred_10 obj_32)
   goals met: 1 of 3
18. (op_4 obj_05 obj_04)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_04)
   goals met: 1 of 3
19. (op_4 obj_04 obj_02)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_02)
   goals met: 1 of 3
20. (op_4 obj_02 obj_19)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_19)
   goals met: 1 of 3
21. (op_4 obj_19 obj_20)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_20)
   goals met: 1 of 3
22. (op_2 obj_20 obj_32)
   deleted: (pred_10 obj_32)
   added: (pred_1) (pred_4 obj_32 obj_20)
   goals met: 2 of 3
23. (op_4 obj_20 obj_19)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_19)
   goals met: 2 of 3
24. (op_4 obj_19 obj_02)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_02)
   goals met: 2 of 3
25. (op_4 obj_02 obj_04)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_04)
   goals met: 2 of 3
26. (op_5 obj_04 obj_29)
   deleted: (pred_4 obj_29 obj_04) (pred_1)
   added: (pred_10 obj_29)
   goals met: 2 of 3
27. (op_4 obj_04 obj_02)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_02)
   goals met: 2 of 3
28. (op_4 obj_02 obj_19)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_19)
   goals met: 2 of 3
29. (op_4 obj_19 obj_01)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_01)
   goals met: 2 of 3
30. (op_4 obj_01 obj_31)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_31)
   goals met: 2 of 3
31. (op_2 obj_31 obj_29)
   deleted: (pred_10 obj_29)
   added: (pred_1) (pred_4 obj_29 obj_31)
   goals met: 3 of 3
